function func(x){
    k = document.getElementById('d1');
    l = document.getElementById('d2');
    j = document.getElementById('d3');
    switch(x){

        case 1:
        k.src = "https://www.thairath.co.th/static/img/horoscope/aries.svg";
        l.innerHTML = "ราศีเมษ";
        j.innerHTML = "การงาน ในช่วงนี้บอกได้เลยว่าเหนื่อย เพราะงานเยอะ!! แถมงานแต่ละงานก็ยากมาก ต้องใช้ทักษะและสกิลหลายๆอย่าง ซึ่งคุณจะผ่านไปได้ (แบบเหนื่อยเอาเรื่องเลยทีเดียว)<br>การเงิน รายได้รายรับผลประโยชน์มากขึ้นการเงินดีมากขึ้นเรื่อยๆ คิดเงินได้เงิน คิดทอง ได้ทอง<br>ความรัก คนมีคู่ความสัมพันธ์รักมั่นคง แม้ว่าจะเจออุปสรรคใดๆก็สามารถจับมือฝ่าฟันไปพร้อมกันได้แน่นอน คนโสดมีเกณฑ์ได้พบรักแบบงงๆ เป็นจุดเริ่มต้นของความรักที่สวยงามในวันข้างหน้า.";
        break;

        case 2:
        k.src = "https://www.thairath.co.th/static/img/horoscope/taurus.svg";
        l.innerHTML = "ราศีพฤษภ";
        j.innerHTML = "การงาน ขอให้เตรียมตัวไว้เพราะว่าโชคใหญ่กำลังจะเข้ามา หากช่วงที่ผ่านมาใครเจออุปสรรคปัญหาขอให้สู้ๆเพราะว่าความสำเร็จเริ่มเข้ามากระชิดตัวคุณแล้ว<br>การเงิน ถือว่าเป็นข่าวดีสำหรับชาวราศีพฤษภ เพราะการเงินเริ่มดีขึ้นมาก ผลประโยชน์รายได้จะเริ่มเข้ามาในช่วงนี้<br>ความรัก คนมีคู่แม้ว่าจะเบื่อๆ กันบ้างเพราะความรักจืดจาง แต่ก็ไม่ปล่อยมือจากกันแน่นอน คนโสดมีเกณฑ์ได้คุยกับใครบางคน แต่ยังไม่ถึงขั้นสานสัมพันธ์เป็นเรื่องเป็นราว.";
        break;

        case 3:
        k.src = "https://www.thairath.co.th/static/img/horoscope/gemini.svg";
        l.innerHTML = "ราศีเมถุน";
        j.innerHTML = "การงาน ถ้าถามว่าเหนื่อยไหม...ต้องตอบเลยว่ามากกกกก เพราะในช่วงนี้ชาวราศีเมถุนจะภาระงานเยอะมาก ทั้งงานราษฎร์งานหลวง เข้ามาแบบไม่ขาดสาย แต่ก็ส่งผลดีกับคนค้าขาย เพราะลูกค้ามากมายเงินทองมั่งมี<br>การเงิน หันหน้าไปทางไหนก็เจอรายจ่ายดักคุณทุกทาง รายได้เข้ามาก็จริง แต่รายจ่ายก็ตามมาติดๆ<br>ความรัก คนมีคู่บางทีก็มีงอนกันเพราะคำพูดไม่กี่คำ คนโสดดวงความรักยังเงียบๆ ยังคงต้องอยู่ในสถานะโสดต่อไปอีกสักพัก.";
        break;

        case 4:
        k.src = "https://www.thairath.co.th/static/img/horoscope/cancer.svg";
        l.innerHTML = "ราศีกรกฎ";
        j.innerHTML = "การงาน ภาระงานในช่วงนี้ไม่ธรรมดา คุณต้องคิดต้องแก้ปัญหาแถมยังต้องตัดสินใจในเรื่องสำคัญอีกด้วย<br>การเงิน ช่วงนี้ควรเน้นการรักษาเสถียรภาพทางการเงินเป็นหลัก เพราะรายจ่ายเยอะแยะมากมาย แถมมีแนวโน้มว่า จะมีคนมาเบียดเบียนมาขอเงินยืมเงินหรือเชิญคุณไปค้ำประกันเงินกู้ให้เขาอีกต่างหาก<br>ความรัก คนมีคู่เนื่องจากช่วงนี้คุณต้องทุ่มเทแรงกายแรงใจไปกับการทำงานเลยไม่ค่อยมีเวลาในการดูแลคนรักสักเท่าไหร่ คนโสดยังโสดเพราะอยู่ในโหมดทำงาน.";
        break;

        case 5:
        k.src = "https://www.thairath.co.th/static/img/horoscope/leo.svg";
        l.innerHTML = "ราศีสิงห์";
        j.innerHTML = "การงาน ในช่วงนี้ดวงการงานดีมีโอกาสประสบความสำเร็จ โดยเฉพาะคนที่ทำงานไหนมานานๆงานนั้นจะก้าวหน้าราบรื่นไปไกลเกินใจหมาย<br>การเงิน ในช่วงนี้เงินทองจะไหลมาเทมา แต่จะไหลมาแบบเอื่อยๆมาแบบเรื่อยๆมาช้ามาทีละก้อน ต้องใช้เวลานานหน่อยแต่ ได้เงินแน่นอน<br>ความรัก คนมีคู่ความสัมพันธ์รักดีมาก ต่างคนต่างเข้าใจกัน เรียนรู้กันอย่างค่อยเป็นค่อยไป คนโสดมีเกณฑ์ได้พบเจอคนใหม่ๆที่ทำให้หัวใจเต้นระรัว.";
        break;

        case 6:
        k.src = "https://www.thairath.co.th/static/img/horoscope/virgo.svg";
        l.innerHTML = "ราศีกันย์";
        j.innerHTML = "การงาน ในช่วงนี้คุณจะมึนๆกับหลายอย่าง เพราะภาระงานที่มาก โจทย์ยากเข้ามาพร้อมกัน มีเรื่องให้ตัดสินใจ หรือบางทีก็ต้องแก้ปัญหาที่คุณไม่ได้เป็นผู้ก่อขึ้น<br>การเงิน เรื่องที่ทำให้คุณยิ้มได้คือเรื่องการเงิน ในช่วงนี้แม้ว่างานหนักแต่รายได้ถือว่าดีต่อใจ หวังผลประโยชน์ก็มีโอกาสที่จะสมหวังอยู่ไม่น้อย<br>ความรัก คนมีคู่ความสัมพันธ์รักไม่หวานแต่ก็มั่นคงมาก คนโสดมีโอกาสได้เจอใครบางคนที่มีผลกับหัวใจ แต่ยังไม่มีสถานะใดๆ เกิดขึ้น.";
        break;

        case 7:
        k.src = "https://www.thairath.co.th/static/img/horoscope/libra.svg";
        l.innerHTML = "ราศีตุล";
        j.innerHTML = "การงาน ดวงชะตาโดยรวมถือว่าอยู่ในเกณฑ์ดี โดยเฉพาะเรื่องการงานถือว่าอยู่ดีและโดดเด่นอย่างมาก ไม่ว่าจะทำงานไหนก็มีโอกาสประสบความสำเร็จแบบคาดไม่ถึง หวังไว้ ๑๐ อาจจะได้ถึง ๑๐๐<br>การเงิน ช่วงนี้งานดีเงินก็ยิ่งดี ยิ่งขยันยิ่งสู้ยิ่งลุย ก็ยิ่งมีโอกาสได้ทรัพย์ได้ลาภมากเท่านั้น<br>ความรัก คนมีคู่ความสัมพันธ์รักมั่นคงเหมือนเกลียวเชือกที่หนาแน่นจนไม่มีวันคลายออกจากกันได้ คนโสดมีเกณฑ์ได้พบเจอคนดีศีลเสมอกันในช่วงนี้.";
        break;

        case 8:
        k.src = "https://www.thairath.co.th/static/img/horoscope/scorpio.svg";
        l.innerHTML = "ราศีพิจิก";
        j.innerHTML = "การงาน ดวงชะตาเริ่มดีขึ้น ดวงพลิกจากร้ายกลายเป็นดี อุปสรรคคลี่คลายกลับกลายเป็นความสำเร็จ ชาวราศีพิจิกเปรียบดั่งม้ามืดที่ก้าวสู้เส้นชัยแบบชนิดที่ใครหลายคนต้องอึ้งกิมกี่ไปเลย<br>การเงิน รายได้จะเข้ามาแบบจัดเต็ม กระแสแห่งโชคลาภจะพัดพาเข้ามาในชีวิต จังหวะดวงดีทำอะไรก็ดีไปหมด<br>ความรัก คนมีคู่ยังรักยังดูแลกันเหมือนเพื่อนที่คอยดูแลเพื่อนอย่างจริงใจ คนโสดแม้ว่าจะได้พบใครบางคนที่มีผลต่อหัวใจ แต่ก็ยังไม่มีความสัมพันธ์ใดๆเกิดขึ้น ณ ตอนนี้.";
        break;

        case 9:
        k.src = "https://www.thairath.co.th/static/img/horoscope/sagittarius.svg";
        l.innerHTML = "ราศีธนู";
        j.innerHTML = "การงาน ในช่วงสัปดาห์นี้ถือว่าดวงดีมาก เพราะหน้าที่การงานก้าวหน้า ความสำเร็จใกล้จะมาถึงแล้ว หากหวังเรื่องงานจะสมหวังในไม่ช้า<br>การเงิน รายได้ดีมากๆ ชาวราศีธนูช่วงนี้จะหาเงินได้เยอะ โดยเฉพาะคนทำธุรกิจก็ถือว่าเป็นช่วงแห่งการโกยเงินเลยก็ว่าได้<br>ความรัก คนมีคู่ต่างคนต่างรักและสนับสนุนกันในทุกๆด้าน ไม่ว่าจะเป็นด้านการงานหรือด้านชีวิตส่วนตัว คนโสดมีโอกาสได้คุยๆ กับใครบางคน แต่ก็เป็นแค่เพื่อนคุย ยังไม่ใช่คนรักจริงจัง.";
        break;

        case 10:
        k.src = "https://www.thairath.co.th/static/img/horoscope/capricorn.svg";
        l.innerHTML = "ราศีมังกร";
        j.innerHTML = "การงาน หน้าที่การงานดีแบบค่อยเป็นค่อยไป อุปสรรคหายไปทีละเรื่อง ขอให้คุณอดทนอีกแค่นิดเดียว ความสำเร็จจะมาอยู่ในกำมือคุณอย่างแน่นอน<br>การเงิน มีเกณฑ์เงินทองมากมาย คุณมีโอกาสได้รายได้จากหลายช่องทาง หากทำงานควบหลายงานจะมีโอกาสรับทรัพย์จนนับไม่ทัน<br>ความรัก คนมีคู่ความรักความสัมพันธ์ถือว่าอยู่ในเกณฑ์ที่ดีมาก คุณและคนรักจะเริ่มเข้าใจกันมากขึ้นหลังจากผ่านอะไรด้วยกันมามากมาย คนโสดมีเกณฑ์ได้พบเจอคนดีแถมโปรไฟล์ดีอีกต่างหาก.";
        break;

        case 11:
        k.src = "https://www.thairath.co.th/static/img/horoscope/aquarius.svg";
        l.innerHTML = "ราศีกุมภ์";
        j.innerHTML = "การงาน ช่วงนี้งานเยอะจนตาลายไปหมด ชาวราศีกุมภ์มีเกณฑ์ต้องเหนื่อยกับงาน แถมบางทีก็เจอโจทย์ยากในการทำงานแบบไม่ตั้งใจ บางทีก็ต้องเหนื่อยกับการดีลงานกับคนหมู่มากหรือการเดินทางบ่อยๆ ในช่วงนี้<br>การเงิน ถือว่าเป็นราศีที่ดวงดีเรื่องการเงินมาก รายได้ดีมีเงินทองไหลมาเทมา มีโอกาสสมหวังเรื่องเงินอย่างมาก<br>ความรัก คนมีคู่แม้ว่าจะมีงอนบ้างในบางครั้ง แต่ก็ไม่ถึงขั้นปล่อยมือจากกันไปอย่างแน่นอน คนโสดช่วงนี้ดวงความรักเงียบๆ รักแท้ยังไม่มาสักที.";
        break;

        case 12:
        k.src = "https://www.thairath.co.th/static/img/horoscope/pisces.svg";
        l.innerHTML = "ราศีมีน";
        j.innerHTML = "การงาน ขอให้ชาวราศีมีนตั้งสติเตรียมตัวเอาไว้ให้พร้อม เพราะในช่วงนี้ภาระงานของชาวราศีมีนจะมากเป็นพิเศษ แถมบางทีก็งานงอกมีปัญหาเข้ามาแบบไม่คาดคิดอีกต่างหาก<br>การเงิน ไม่ว่าหันซ้ายหรือหันขวาก็เจอแต่รายจ่าย แต่ยังดีที่รายได้ยังเข้ากระเป๋าต่อเนื่อง<br>ความรัก คนมีคู่คนรักจะเป็นกำลังหลักที่คอยสนับสนุนคุณในทุกๆเรื่อง ทั้งการงาน การเงินและเรื่องภายในครอบครัว คนโสดมีเกณฑ์ได้เจอคนดีๆที่คุณไม่คาดคิดว่าจะเป็นคนนี้.";
        break;
    }
}